import os
import torch

class Config:
    def __init__(self):
        current_dir = os.path.dirname(os.path.abspath(__file__))
        project_root = os.path.dirname(current_dir)

        # 数据路径
        self.data_path = os.path.join(project_root, 'data', 'CSL-500', 'processed', 'csl500_data.npy')
        self.labels_path = os.path.join(project_root, 'data', 'CSL-500', 'processed', 'csl500_labels.npy')

        # 模型路径
        self.results_path = r"E:\My struggle\sign_language_recognition\model_checkpoints\k_fold_results.pth"
        self.model_path = r"E:\My struggle\sign_language_recognition\model_checkpoints\best_model_fold0.pth"

        # 数据相关参数
        self.num_frames = 36  # 添加这行
        self.num_joints = 17  # 修改为实际的关节点数量
        self.input_dim = 2
        self.num_classes = 500
        self.input_channels = self.num_joints * self.input_dim
        self.min_sequence_length = 10  # 最小序列长度，用于重复单帧数据

        # 模型相关参数
        self.hidden_dim = 64
        self.output_dim = 500
        self.num_gru_layers = 1
        self.num_attention_heads = 4
        self.crop_size = 256  # 或者其他适合您模型的值

        # 训练相关参数
        self.batch_size = 32
        self.num_epochs = 150
        self.learning_rate = 0.0001
        self.weight_decay = 1e-4
        self.dropout_rate = 0.5
        self.n_splits = 5
        self.early_stopping_patience = 10
        self.seed = 42

        # 学习率调度器相关参数
        self.lr_scheduler = 'cosine'
        self.cosine_lr_min = 1e-6
        self.reduce_factor = 0.5
        self.reduce_patience = 5

        # 边索引（用于图卷积网络）
        self.pose_edge_index = torch.tensor([
            [0, 1, 1, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14, 15, 15,
             16],
            [1, 0, 2, 1, 3, 2, 4, 3, 5, 4, 6, 5, 7, 6, 8, 7, 9, 8, 10, 9, 11, 10, 12, 11, 13, 12, 14, 13, 15, 14, 16,
             15]
        ], dtype=torch.long)

        # 验证文件路径
        assert os.path.exists(self.data_path), f"Data file not found: {self.data_path}"
        assert os.path.exists(self.labels_path), f"Labels file not found: {self.labels_path}"
        assert os.path.exists(self.model_path), f"Model file not found: {self.model_path}"

        self.label_map ={
            0: "情况", 1: "前途", 2: "形势", 3: "局势",
            4: "动态", 5: "形态", 6: "声势", 7: "优势", 8: "现实", 9: "实际",
            10: "定局", 11: "局面", 12: "局部", 13: "部分", 14: "过渡",
            15: "标志", 16: "目标", 17: "目的", 18: "意义", 19: "结果",
            20: "作用", 21: "用途", 22: "功能", 23: "环节", 24: "头绪",
            25: "公益", 26: "利益", 27: "成效（成功）", 28: "效益", 29: "有效",
            30: "程度", 31: "进度", 32: "象征", 33: "根源", 34: "体现",
            35: "普及", 36: "提高", 37: "利用", 38: "引导", 39: "开展",
            40: "发展", 41: "发挥", 42: "发动", 43: "发生", 44: "出现",
            45: "成立（建立）", 46: "形成", 47: "构成", 48: "实行", 49: "转折（拐弯）",
            50: "扭转", 51: "好转", 52: "改善（改良）", 53: "搞清", 54: "承受",
            55: "摆脱", 56: "解除", 57: "解散", 58: "放弃（放）", 59: "废除",
            60: "民主", 61: "自由", 62: "集中", 63: "安定", 64: "团结",
            65: "庄严", 66: "热闹", 67: "富裕", 68: "富强", 69: "丰富",
            70: "小康", 71: "和睦", 72: "幸福", 73: "吉祥", 74: "安静",
            75: "寂静", 76: "孤立", 77: "贫苦", 78: "禁止", 79: "反复（重复）",
            80: "延长", 81: "耽误", 82: "避免", 83: "专门", 84: "圆满",
            85: "困难", 86: "容易", 87: "紧张", 88: "稳定", 89: "基础（根据）",
            90: "基本", 91: "加强", 92: "详细", 93: "保留", 94: "安全",
            95: "危害", 96: "升", 97: "降", 98: "涨", 99: "落",
            100: "来", 101: "去（出）", 102: "到", 103: "晒", 104: "醒",
            105: "有", 106: "没有（无）", 107: "是", 108: "不是", 109: "属于",
            110: "小", 111: "多", 112: "少", 113: "长", 114: "短",
            115: "高", 116: "矮（低）", 117: "远", 118: "近", 119: "宽（宽广）",
            120: "窄（狭）", 121: "粗", 122: "细（细致）", 123: "厚", 124: "薄",
            125: "轻", 126: "重", 127: "沉重", 128: "硬", 129: "软",
            130: "深", 131: "浅", 132: "快", 133: "慢", 134: "冷",
            135: "热（汗）", 136: "暖（温暖、暖和）", 137: "胖（肥）", 138: "瘦", 139: "饱",
            140: "饿", 141: "满", 142: "新", 143: "旧", 144: "好",
            145: "坏", 146: "差（劣）", 147: "漏（滴）", 148: "真", 149: "假",
            150: "美", 151: "丑", 152: "正", 153: "歪（倾向）", 154: "直",
            155: "曲（曲折）", 156: "平（平等）", 157: "皱", 158: "褶子", 159: "干",
            160: "温", 161: "单", 162: "双", 163: "疏", 164: "密",
            165: "密集", 166: "空", 167: "实", 168: "紧", 169: "松",
            170: "胀", 171: "缩", 172: "强", 173: "弱", 174: "浓",
            175: "淡", 176: "清淡", 177: "嫩", 178: "老", 179: "尖（锋利、尖锐）",
            180: "钝（秃）", 181: "破", 182: "缺", 183: "偏", 184: "扁（瘪）",
            185: "韧", 186: "颜色（彩色）", 187: "红", 188: "橙色", 189: "黄",
            190: "绿", 191: "碧绿", 192: "青", 193: "蓝", 194: "紫",
            195: "褐色", 196: "灰", 197: "棕", 198: "黑", 199: "白",
            200: "嫂嫂", 201: "姐姐", 202: "姐夫", 203: "弟弟", 204: "妹妹",
            205: "宝贝", 206: "儿子（男孩）", 207: "女儿（女孩）", 208: "孙子", 209: "孙女",
            210: "阿姨", 211: "表哥", 212: "丈夫", 213: "妻子", 214: "夫人",
            215: "职业", 216: "工人", 217: "矿工", 218: "农民", 219: "牧民",
            220: "小孩儿（儿童、少年）", 221: "青年", 222: "成年人（大人）", 223: "老人", 224: "残疾人",
            225: "聋人", 226: "盲人", 227: "肢残人", 228: "弱智人", 229: "祖父（爷爷）",
            230: "祖母（奶奶）", 231: "外祖父（外公）", 232: "外祖母（外婆）", 233: "爸爸", 234: "妈妈",
            235: "岳父", 236: "岳母", 237: "公公", 238: "婆婆", 239: "哥哥",
            240: "邻居", 241: "自己", 242: "我", 243: "你", 244: "他（她、它）",
            245: "我们", 246: "你们", 247: "他们", 248: "别人", 249: "大家",
            250: "群众", 251: "同志", 252: "同事", 253: "同学", 254: "同胞",
            255: "朋友", 256: "男", 257: "女（姑娘）", 258: "先生", 259: "女士",
            260: "身体", 261: "头（脑）", 262: "头发", 263: "辫子", 264: "脸",
            265: "眼", 266: "耳", 267: "鼻", 268: "口", 269: "舌",
            270: "牙齿", 271: "脚", 272: "心", 273: "人", 274: "人类",
            275: "人民", 276: "国民", 277: "公民", 278: "市民", 279: "居民",
            280: "裁缝", 281: "模特", 282: "商人", 283: "经纪人", 284: "个体户",
            285: "会计", 286: "园丁", 287: "保姆", 288: "向导", 289: "猎手",
            290: "解放军", 291: "警察", 292: "武警", 293: "刑警", 294: "保安",
            295: "保卫", 296: "门卫", 297: "食品", 298: "食物", 299: "米饭（粮食）",
            300: "公务员", 301: "职员", 302: "知识分子", 303: "教师", 304: "教练",
            305: "翻译", 306: "记者", 307: "编辑", 308: "作家", 309: "画家",
            310: "导演", 311: "演员", 312: "医生（大夫）", 313: "护士", 314: "学生",
            315: "律师", 316: "驾驶员", 317: "邮递员", 318: "炊事员", 319: "保育员",
            320: "交流", 321: "沟通", 322: "礼貌", 323: "谦让（客气）", 324: "招呼",
            325: "观察", 326: "拜访", 327: "友谊", 328: "约会", 329: "会见（接见）",
            330: "会客", 331: "祝愿", 332: "庆祝", 333: "民政", 334: "福利",
            335: "捐献", 336: "事业", 337: "事情", 338: "事件", 339: "事例",
            340: "婚姻", 341: "亲切", 342: "美容", 343: "工作", 344: "地位",
            345: "经验", 346: "就业", 347: "岗位", 348: "服务", 349: "名声",
            350: "名望", 351: "负责", 352: "任务", 353: "责任（委任）", 354: "推荐",
            355: "招聘", 356: "社会", 357: "环境", 358: "传统", 359: "气氛",
            360: "拖把（墩布）", 361: "扫帚", 362: "纸篓", 363: "烟灰缸", 364: "扇子",
            365: "刀", 366: "打火机", 367: "电视机", 368: "电冰箱", 369: "电风扇",
            370: "空调", 371: "洗衣机", 372: "籍贯（老家）", 373: "名片", 374: "名义",
            375: "对象", 376: "欢聚", 377: "爱慕", 378: "爱戴", 379: "恋爱",
            380: "枕头", 381: "蚊帐", 382: "毛毯", 383: "地毯", 384: "坐垫",
            385: "帘子", 386: "首饰", 387: "耳环", 388: "项链", 389: "手镯",
            390: "戒指", 391: "口红", 392: "香水", 393: "护肤霜", 394: "肥皂",
            395: "牙刷（刷牙）", 396: "牙膏", 397: "毛巾", 398: "手帕", 399: "手表",
            400: "眼镜", 401: "镜子", 402: "盆", 403: "洗脸盆", 404: "茶壶",
            405: "杯子", 406: "尺子", 407: "剪刀", 408: "针", 409: "线",
            410: "按钮（开关）", 411: "纽扣", 412: "盒子", 413: "锁", 414: "钥匙",
            415: "伞", 416: "温度计（寒暑表）", 417: "手电筒", 418: "电池", 419: "抹布",
            420: "油", 421: "盐", 422: "酱", 423: "酱油", 424: "粉丝",
            425: "粉条", 426: "香烟", 427: "天空", 428: "天文", 429: "宇宙",
            430: "星", 431: "恒星", 432: "行星", 433: "卫星", 434: "彗星",
            435: "流星", 436: "地球", 437: "月亮", 438: "太阳", 439: "气象",
            440: "粥", 441: "面粉", 442: "面包", 443: "面条", 444: "挂面",
            445: "馒头", 446: "花卷", 447: "包子", 448: "饺子", 449: "馄饨",
            450: "饼", 451: "烙饼", 452: "馅儿饼", 453: "窝头", 454: "年糕",
            455: "粽子", 456: "元宵（汤圆）", 457: "油条", 458: "汤", 459: "快餐",
            460: "西餐", 461: "蛋糕", 462: "点心", 463: "饼干", 464: "汉堡包",
            465: "罐头", 466: "果脯", 467: "肉", 468: "蛋", 469: "饮料",
            470: "牛奶", 471: "咖啡", 472: "豆浆", 473: "酒", 474: "啤酒",
            475: "汽水", 476: "冰淇淋", 477: "冰棍儿（雪糕）", 478: "茶",
            479: "开水", 480: "天气（气候）", 481: "天气预报", 482: "摄氏度",
            483: "晴", 484: "阴", 485: "云", 486: "雨", 487: "家具",
            488: "床", 489: "桌子", 490: "椅子", 491: "凳子", 492: "沙发",
            493: "茶几", 494: "衣箱", 495: "衣橱", 496: "抽屉", 497: "床罩（床单）",
            498: "被子", 499: "被套"
        }

